/*Вычислить и вывести на экран косинусы углов в 60, 45 и 40 градусов
 без использования функции Math.toDegrees(n).*/
public class subject2task1 {

    public static void main(String[]args){

    int a = 60;
    int b = 45;
    int c = 40;

    System.out.println(Math.cos(a));
    System.out.println(Math.cos(b));
    System.out.println(Math.cos(c));
}
}