public class Tema1Zadanie3Math {


    /*В переменной n хранится вещественное число с ненулевой дробной частью.
Создайте программу, округляющую число n до ближайшего целого и выводящую результат на экран.*/

        public static void main(String[] args) {
            double n = 3.6; //
            System.out.println(Math.round(n));
        }
    }