public class Tema1Zadanie2 {
    public static void main(String[] args) {
        int n = 94;

        int a = (n / 10); //первая цифра
        int b = (n % 10); //вторая цифра
        System.out.print(a+b); //сумма

    }
}
// В переменной n хранится натуральное двузначное число.
// Создайте программу, вычисляющую и выводящую на экран сумму цифр числа n.