public class Tema1Zadanie3 {
    public static void main(String[] args) {
        double n = 1.9;
        //int b = (n);
        //System.out.print(b);
    }
}

//В переменной n хранится вещественное число с ненулевой дробной частью.
// Создайте программу, округляющую число n до ближайшего целого и выводящую результат на экран.
